Autodesk.Revit.DB.Structure.ExtElemChangeBeamSectionRegistry.RegisterInterface(Autodesk.Revit.DB.Structure.IExtElemChangeBeamSection)
Registers a IExtElemChangeBeamSection
provider:
IExtElemChangeBeamSection to be registered.
Throws Autodesk.Revit.Exceptions.ArgumentException:
The provider object is not valid.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
A non-optional argument was null
Throws Autodesk.Revit.Exceptions.InvalidOperationException:
There is already registered Connections Provider.
Since:
2018